01-ahmed-body/cases/slant30_re4.18M_symtest_transient/constant/physicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      physicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

viscosityModel  constant;

// Air kinematic viscosity, matching the ERCOFTAC Ahmed body reference
// data (validation/reference_data/) and the OpenFOAM motorBike/
// motorBikeSteady tutorials.
nu              [0 2 -1 0 0 0 0] 1.5e-05;

// ************************************************************************* //
